In [3]:
print("hello")

hello

In [5]:
name=["ashish","anand","abhinav","piyush","shashi","ram",]
college=["uit","dit","gue","tulas","upes","maya"]
city=["ddn","delhi","patna","mumbai","rajpur","haridwar"]

In [6]:
stu_dict={ 
       "name":name,
      "college":college,
      "city":city    
}

In [7]:
import pandas as pd

In [8]:
data=pd.DataFrame(stu_dict)

In [9]:
data

      name college      city
0   ashish     uit       ddn
1    anand     dit     delhi
2  abhinav     gue     patna
3   piyush   tulas    mumbai
4   shashi    upes    rajpur
5      ram    maya  haridwar

In [13]:
data.head()

      name college    city
0   ashish     uit     ddn
1    anand     dit   delhi
2  abhinav     gue   patna
3   piyush   tulas  mumbai
4   shashi    upes  rajpur

In [14]:
data.tail()

      name college      city
1    anand     dit     delhi
2  abhinav     gue     patna
3   piyush   tulas    mumbai
4   shashi    upes    rajpur
5      ram    maya  haridwar

In [11]:
data["name"]

0     ashish
1      anand
2    abhinav
3     piyush
4     shashi
5        ram
Name: name, dtype: object

In [12]:
data[["name","city"]]

      name      city
0   ashish       ddn
1    anand     delhi
2  abhinav     patna
3   piyush    mumbai
4   shashi    rajpur
5      ram  haridwar

In [ ]:
data[["name","city"]]

In [15]:
data["name"][data["college"]=="dit"]

1    anand
Name: name, dtype: object

In [17]:
data[["name","college"]][data["city"]=="ddn"]

     name college
0  ashish     uit